/* Title for downloading */
"Importing..." = "Importing...";

/* Progress window text for when exporting to cloud */
"Exporting..." = "Exporting...";

/* Message text when deleting button accossiated with cloud */
"Are you sure you want to delete this Place? Deleting this Place will also remove it from your TechSmith account." = "Are you sure you want to delete this Place? Deleting this Place will also remove it from your TechSmith account.";

/* Cancel (button) */
"Cancel" = "Cancel";

/* Delete (button) */
"Delete" = "Delete";

/* Delete Place - title */
"Delete Place" = "Delete Place";

/* plugin name */
"My Places" = "My Places";

/* plugin button tooltip */
"Upload to My Places to share a link." = "Upload to My Places to share a link.";

/* Content is ready to be pasted */
"The link to your capture is ready to be pasted." = "The link to your capture is ready to be pasted.";

/* Bad characters used */
"Invalid title" = "Invalid title";

/* Invalid strings message */
"Titles cannot contain these characters:" = "Titles cannot contain these characters:";

/* Error connecting title to my Places */
"Unable to connect to My Places" = "Unable to connect to My Places";

/* Error connecting title */
"Unable to connect" = "Unable to connect";

/* Informative text for alert that shows up if the user tries to share a file while offline */
"Unable to connect to server. Please check your internet connection and try again." = "Unable to connect to server. Please check your internet connection and try again.";
